## CHAPTER 5
# Getting Started with pandas
---
## DataFrame

In [1]:
%pylab inline

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
plt.style.use('ggplot')

Populating the interactive namespace from numpy and matplotlib

In [3]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
s = pd.Series(sdata)

display(s, s.index, s.values)

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

Index(['Ohio', 'Oregon', 'Texas', 'Utah'], dtype='object')

array([35000, 16000, 71000,  5000], dtype=int64)

In [4]:
d = pd.DataFrame(s)
display(d, d.shape)
display(d.index.name, d.columns)

            0
Ohio    35000
Oregon  16000
Texas   71000
Utah     5000

(4, 1)

None

RangeIndex(start=0, stop=1, step=1)

In [47]:
s.name = 'population'
s.index.name = 'state'

d = pd.DataFrame(s)
d.columns.name='state_info'
display(d, d.shape)
display(d.index, d.columns)

state_info  population
state
Ohio             35000
Oregon           16000
Texas            71000
Utah              5000

(4, 1)

Index(['Ohio', 'Oregon', 'Texas', 'Utah'], dtype='object', name='state')

Index(['population'], dtype='object', name='state_info')

In [15]:
d['year']=[2018]*len(d.index)
display(d, d.columns)

d['year'][0]=2017
display(d)

        population  year
state
Ohio         35000  2018
Oregon       16000  2018
Texas        71000  2018
Utah          5000  2018

Index(['population', 'year'], dtype='object')

        population  year
state
Ohio         35000  2017
Oregon       16000  2018
Texas        71000  2018
Utah          5000  2018

In [12]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'popul': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = pd.DataFrame(data)
display(frame)

    state  year  popul
0    Ohio  2000    1.5
1    Ohio  2001    1.7
2    Ohio  2002    3.6
3  Nevada  2001    2.4
4  Nevada  2002    2.9

In [11]:
# frame['state']
help(frame.pop)

Help on method pop in module pandas.core.generic:

pop(item) method of pandas.core.frame.DataFrame instance
    Return item and drop from frame. Raise KeyError if not found.

    Parameters
    ----------
    item : str
        Column label to be popped

    Returns
    -------
    popped : Series

    Examples
    --------
    >>> df = pd.DataFrame([('falcon', 'bird',    389.0),
    ...                    ('parrot', 'bird',     24.0),
    ...                    ('lion',   'mammal',   80.5),
    ...                    ('monkey', 'mammal', np.nan)],
    ...                   columns=('name', 'class', 'max_speed'))
    >>> df
         name   class  max_speed
    0  falcon    bird      389.0
    1  parrot    bird       24.0
    2    lion  mammal       80.5
    3  monkey  mammal        NaN

    >>> df.pop('class')
    0      bird
    1      bird
    2    mammal
    3    mammal
    Name: class, dtype: object

    >>> df
         name  max_speed
    0  falcon      389.0
    1  parrot       24.0
    2    lion       80.5
    3  monkey        NaN

In [17]:
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [13]:
frame2 = pd.DataFrame(data, columns=['year','state','pop','debt'], index=['one','two','three','four','five'])
display(frame2)

       year   state  pop debt
one    2000    Ohio  NaN  NaN
two    2001    Ohio  NaN  NaN
three  2002    Ohio  NaN  NaN
four   2001  Nevada  NaN  NaN
five   2002  Nevada  NaN  NaN

In [22]:
display(frame2['state'], frame2.state)

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [32]:
display(frame2[:3], frame2[1:2], frame2.iloc[1], frame2.loc['two'])

       year state  pop debt
one    2000  Ohio  1.5  NaN
two    2001  Ohio  1.7  NaN
three  2002  Ohio  3.6  NaN

     year state  pop debt
two  2001  Ohio  1.7  NaN

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: two, dtype: object

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: two, dtype: object

In [14]:
#frame2['debt']=16.5
frame2.debt=16.5
frame2

       year   state  pop  debt
one    2000    Ohio  NaN  16.5
two    2001    Ohio  NaN  16.5
three  2002    Ohio  NaN  16.5
four   2001  Nevada  NaN  16.5
five   2002  Nevada  NaN  16.5

In [17]:
frame2.debt[0]=0
frame2.debt=range(5)
frame2

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

       year   state  pop  debt
one    2000    Ohio  NaN     0
two    2001    Ohio  NaN     1
three  2002    Ohio  NaN     2
four   2001  Nevada  NaN     3
five   2002  Nevada  NaN     4

In [37]:
frame2.debt = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [40]:
frame2.state == 'Ohio'
frame2['eastern'] = (frame2.state == 'Ohio')
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [42]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [43]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
    'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [44]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [48]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [49]:
pd.DataFrame([{'one': 1, 'two': 2}, {'one': 11, 'two': 12}])

   one  two
0    1    2
1   11   12